

/** Базовые числительные */
export const SPELLED_NUMBERS = {
	[0]: "ноль",
	[1]: "один",
	[2]: "два",
	[3]: "три",
	[4]: "четыре",
	[5]: "пять",
	[6]: "шесть",
	[7]: "семь",
	[8]: "восемь",
	[9]: "девять",
	[10]: "десять",
	[11]: "одиннадцать",
	[12]: "двенадцать",
	[13]: "тринадцать",
	[14]: "четырнадцать",
	[15]: "пятнадцать",
	[16]: "шестнадцать",
	[17]: "семнадцать",
	[18]: "восемнадцать",
	[19]: "девятнадцать",
	[20]: "двадцать",
	[30]: "тридцать",
	[40]: "сорок",
	[50]: "пятьдесят",
	[60]: "шестьдесят",
	[70]: "семьдесят",
	[80]: "восемьдесят",
	[90]: "девяносто",
	[100]: "сто",
	[200]: "двести",
	[300]: "триста",
	[400]: "четыреста",
	[500]: "пятьсот",
	[600]: "шестьсот",
	[700]: "семьсот",
	[800]: "восемьсот",
	[900]: "девятьсот",
};


/** Наименования степеней тысячи */
export const SPELLED_DIGITS = {
	[0]: ["", "", ""],
	[1]: ["тысяча", "тысячи", "тысяч"],
	[2]: ["миллион", "миллиона", "миллионов"],
	[3]: ["миллиард", "миллиарда", "миллиардов"],
	[4]: ["триллион", "триллиона", "триллионов"],
	[5]: ["квадриллион", "квадриллиона", "квадриллионов"],
	[6]: ["квинтиллион", "квинтиллиона", "квинтиллионов"],
	[7]: ["секстиллион", "секстиллиона", "секстиллионов"]
};


/** Наименования денежных и временнЫх единиц измерения */
export const MEASURES_FORMS = {
	"рубль": ["рубль", "рубля", "рублей"],
	"копейка": ["копейка", "копейки", "копеек"],
	"секунда": ["секунда", "секунды", "секунд"],
	"минута": ["минута", "минуты", "минут"],
	"час": ["час", "часа", "часов"],
	"день": ["день", "дня", "дней"],
	"неделя": ["неделя", "недели", "недель"],
	"месяц": ["месяц", "месяца", "месяцев"],
	"год": ["год", "года", "лет"],
};


/**
 * Регулярное выражение для разбивки числа на группы разрядов
 * @example `11222333`.replace(/(\d)(?=((\d{3})+)(\D|$))/g, '$1 ') ===> `11 222 333`
 */
export const DIGIT_GROUPING_REGEXP = /(\d)(?=((\d{3})+)(\D|$))/g;


/** Регулярное выражение для поиска русских мужских отчеств */
export const MALE_MIDNAMES_STRING = '\\S+(?:([вкмть]ич))$';


/** Регулярное выражение для поиска русских женских отчеств */
export const FEMALE_MIDNAMES_STRING = '\\S+(?:([вчш]на))$';


/** Регулярное выражение для поиска всех русских отчеств */
export const ALL_MIDNAMES_STRING = '\\S+(?:([вкмть]ич)|([вчш]на))$';


/** Регулярное выражение для отсева всех русских отчеств */
export const ALL_NAMES_STRING = '\\S+(?<!([вкмть]ич)|([вчш]на))$';


/** Регулярное выражение для формирования подсказок по списку должностей */
export const POSITIONS_REGEXP = /((.+)(ный|вый|кий|ший|щий))?\s*((.+)(к|р|т|ель|щий))?\s+(.+)?/g;






export const monthNamesRusRegexp = /янв|фев|мар|апр|май|июн|июл|авг|сен|окт|ноя|дек/;
export const monthNamesEngRegexp = /jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec/;

export const dateRegexp1 = /([1-2][0-9][0-9][0-9])([\.\-/\s])(([0-1]?[0-9])|jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec)(\w+)?([\.\-/\s])([0-3]?[0-9])$/;
export const dateRegexp2 = /([0-3]?[0-9])([\.\-/\s])(([0-1]?[0-9])|jan|feb|mar|apr|may|jun|jul|aug|sep|oct|nov|dec)(\w+)?([\.\-/\s])([1-2][0-9][0-9][0-9])$/;

/** Дата в формате ГГГГ-ММ-ДД или ГГГГ-МММ-ДД */
export const dateRegexp3 = /([1-2][0-9][0-9][0-9])([\.\-/\s])(([0-1][0-9])|янв|фев|мар|апр|май|июн|июл|авг|сен|окт|ноя|дек)(.+)?([\.\-/\s])([0-3][0-9])$/;

/** Дата в формате ДД-ММ-ГГГГ или ДД-МММ-ГГГГ */
export const dateRegexp4 = /([0-3][0-9])([\.\-/\s])(([0-1][0-9])|янв|фев|мар|апр|май|июн|июл|авг|сен|окт|ноя|дек)(.+)?([\.\-/\s])([1-2][0-9][0-9][0-9])$/;